const text =
  "у лукоморья клён зелёный; златая цепь на клён том; и днём и ночью кот учёный; всё ходит по цепи кругом; идёт направо — песнь заводит; налево — сказку говорит; там чудеса: там леший бродит; русалка на ветвях сидит; там на неведомых дорожках; следы невиданных зверей; избушка там на курьих ножках; стоит без окон, без дверей; там лес и дол видений полны; там о заре прихлынут волны; на брег песчаный и пустой; и тридцать витязей прекрасных; чредой из вод выходят ясных; и с ними дядька их морской; там королевич мимоходом; пленяет грозного царя; там в облаках перед народом; через леса, через моря; колдун несёт богатыря; в темнице там царевна тужит; а бурый волк ей верно служит; там ступа с бабою ягой; идёт, бредёт сама собой; там царь кащей над златом чахнет; там русский дух… там русью пахнет!; и там я был, и мёд я пил; у моря видел клён зелёный; под ним сидел, и кот учёный; свои мне сказки говорил.";

//task 1
console.log(`1. Количество символов в тексте: ${text.length}`);

//task 2
const result = text.replace(/;/g, ",\n");
console.log(`2. Текст с переносами строк: \n ${result}`);

//task 3
const substring = result.replace(/\s/g, "");
console.log(`3. Текст с удалёнными пробелами: \n ${substring}`);

//task 4 - сделала с 27-го индекса, чтобы слово "златая" было целиком
const newText = result.slice(27, 50);
console.log(`4. Извлечение подстроки: ${newText}`);

//task 5
const replacedText = newText.replace(/клён/g, "дубе");
console.log(`5. Замена "клён" на "дубе": ${replacedText}`);

//task 6
const replacedText2 = result.toUpperCase();
console.log(`6. Строка result в верхнем регистре: \n ${replacedText2}`);

//task 7
const replacedText3 = result.replace(/клён/g, "дуб");
console.log(`7. Замена "клён" на "дуб" (все вхождения) в переменной result: \n ${replacedText3}`);

//task 8
const index = text.indexOf("моря");
console.log(`8. Индекс первого вхождения "моря": ${index}`);

//task 9
const modifiedText = replacedText[0].toUpperCase();
console.log(`9. Строка с измененной первой буквой: ${modifiedText}`);
